#+TITLE: Finance
#+AUTHOR: Nicholas Huber
#+DATE: 20201114
#+STARTUP: overview
#+PROPERTY: header-args:ledger :tangle ~/Documents/Finance/budget.lgr

** Equity Sheet
#+NAME: equitySheet
|---+----------------------+-------+---+------+--------|
|   | Item/Description     | Value | - | Debt | Equity |
|---+----------------------+-------+---+------+--------|
| # | Real Estate ____     |     0 | - |    0 |      0 |
| # | Real Estate ___      |     0 | - |    0 |      0 |
| # | Car ___              |       | - |      |      0 |
| # | Car ___              |       | - |      |      0 |
| # | Cash on Hand         |       | - |      |      0 |
| # | Checking Account 1   |       | - |      |      0 |
| # | Checking Account 2   |       | - |      |      0 |
| # | Savings Account 1    |       | - |      |      0 |
| # | Savings Account 2    |     0 | - |    0 |      0 |
| # | Money Market Account |     0 | - |    0 |      0 |
| # | Mutual Funds         |     0 | - |    0 |      0 |
| # | Retirement Plan      |     0 | - |    0 |      0 |
| # | Stocks/Bonds         |     0 | - |    0 |      0 |
| # | Cash Value Insurance |     0 | - |    0 |      0 |
| # | Household Items      |       | - |      |      0 |
| # | Jewelry              |       | - |      |      0 |
| # | Antiques             |       | - |    0 |      0 |
| # | Boat                 |     0 | - |    0 |      0 |
| # | Credit Card Debt     |       | - |      |      0 |
| # | Other ___            |     0 | - |    0 |      0 |
| # | Other ___            |     0 | - |    0 |      0 |
| # | Other ___            |     0 | - |    0 |      0 |
|---+----------------------+-------+---+------+--------|
| # | Total                |     0 | - |    0 |      0 |
|---+----------------------+-------+---+------+--------|
#+TBLFM: $6=$3-$5::@>$3=vsum(@2$3..@>>$3)::@>$5=vsum(@2$5..@>>$5)::@>$6=@>$3-@>$5 
** Income Sheet
#+NAME: incomeSheet
|-----------------+---------+-----------------|
| Source          |  Amount | Period/Describe |
|-----------------+---------+-----------------|
| Salary 1        | 3984.03 | Montly takehome |
| Salary 2        |    0.00 |                 |
| Bonus           |    0.00 |                 |
| Dividend Income |    0.00 |                 |
| Cash Gifts      |    0.00 |                 |
|-----------------+---------+-----------------|
| TOTAL           | 3984.03 |                 |
|-----------------+---------+-----------------|
#+TBLFM: @>$2=vsum(@2$2..@>>$2)

** Breakdown
#+NAME: expensesBreakdown
|---+-------------------+---------------+--------+----------------|
|   | Item Needed       | Annual Amount | / 12 = | Monthly Amount |
|---+-------------------+---------------+--------+----------------|
| # | Rent              |         11400 | / 12 = |         950.00 |
| # | Renters Insurance |        125.00 | / 12 = |          10.42 |
| # | Replace Furniture |          0.00 | / 12 = |           0.00 |
| # | Health Insurance  |          0.00 | / 12 = |           0.00 |
| # | Life Insurance    |          0.00 | / 12 = |           0.00 |
| # | Car Insurance     |        782.64 | / 12 = |          65.22 |
| # | Car Repair        |        660.00 | / 12 = |          55.00 |
| # | License/Tags      |        160.00 | / 12 = |          13.33 |
| # | Replace Car       |          0.00 | / 12 = |           0.00 |
| # | Clothing: Adult   |       1200.00 | / 12 = |         100.00 |
| # | Tuition           |          0.00 | / 12 = |           0.00 |
| # | Banknotes         |       3732.00 | / 12 = |         311.00 |
| # | Vacation          |          0.00 | / 12 = |           0.00 |
| # | Internet          |        672.00 | / 12 = |          56.00 |
| # | Gifts             |          0.00 | / 12 = |           0.00 |
| # | Hulu              |        119.88 | / 12 = |           9.99 |
| # | Adobe             |        192.48 | / 12 = |          16.04 |
| # | Laundry           |        540.00 | / 12 = |          45.00 |
| # | Other ____        |          0.00 | / 12 = |           0.00 |
|---+-------------------+---------------+--------+----------------|
| # | TOTAL             |      19584.00 | / 12 = |        1632.00 |
|---+-------------------+---------------+--------+----------------|
#+TBLFM: $5=$3/12;%.2f::@>$3=vsum(@-II$3..@-I$3);%.2f::@>$5=vsum(@-II$5..@-I$5);%.2f::

** Cashflow Chart
#+NAME: cashflowChart
|---+-------------------------+------------+----------|
|   | Category                | Budgeted $ | Subtotal |
|---+-------------------------+------------+----------|
|   | Charitable Gifts        |       0.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |       0. |
|---+-------------------------+------------+----------|
|   | Savings                 |            |          |
|---+-------------------------+------------+----------|
|   | Emergency Fund          |       0.00 |          |
|   | Retirement Fund         |       0.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |       0. |
|---+-------------------------+------------+----------|
|   | Housing                 |            |          |
|---+-------------------------+------------+----------|
|   | Renters Insurance       |      10.42 |          |
|   | Replace Furniture       |       0.00 |          |
|   | Rent                    |     950.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |   960.42 |
|---+-------------------------+------------+----------|
|   | Utilities               |            |          |
|---+-------------------------+------------+----------|
|   | Electricity             |       0.00 |          |
|   | Water                   |       0.00 |          |
|   | Gas                     |       0.00 |          |
|   | Phone                   |     105.00 |          |
|   | Internet                |      56.00 |          |
|   | Hulu                    |       9.99 |          |
|   | Adobe                   |      16.05 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |   187.04 |
|---+-------------------------+------------+----------|
|   | Food                    |            |          |
|---+-------------------------+------------+----------|
|   | Grocery                 |     300.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |     300. |
|---+-------------------------+------------+----------|
|   | Transportation          |            |          |
|---+-------------------------+------------+----------|
|   | Car Payment 1           |       0.00 |          |
|   | Gas and Oil             |      80.00 |          |
|   | Repairs and Tires       |       0.00 |          |
|   | Car Insurance           |      65.00 |          |
|   | License and Tags        |      13.33 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |   158.33 |
|---+-------------------------+------------+----------|
|   | Clothing                |            |          |
|---+-------------------------+------------+----------|
|   | Children                |       0.00 |          |
|   | Adults                  |     100.00 |          |
|   | Cleaning/Laundry        |      45.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |     145. |
|---+-------------------------+------------+----------|
|   | Medical/Health          |            |          |
|---+-------------------------+------------+----------|
|   | Health Insurance        |       0.00 |          |
|   | Drugs                   |       0.00 |          |
|   | Other ______            |       0.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |       0. |
|---+-------------------------+------------+----------|
|   | Personal                |            |          |
|---+-------------------------+------------+----------|
|   | Life Insurance          |       0.00 |          |
|   | Toiletries              |       0.00 |          |
|   | Cosmetics               |       0.00 |          |
|   | Hair Care               |       0.00 |          |
|   | Gifts                   |       0.00 |          |
|   | Misc                    |       0.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |       0. |
|---+-------------------------+------------+----------|
|   | Blow$$                  |      80.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |      80. |
|---+-------------------------+------------+----------|
|   | Recreation              |            |          |
|---+-------------------------+------------+----------|
|   | Entertainment           |      80.00 |          |
|   | Vacation                |       0.00 |          |
|   | Restaurants             |      80.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |     160. |
|---+-------------------------+------------+----------|
|   | Debts                   |            |          |
|---+-------------------------+------------+----------|
|   | Visa (Miranda)          |       0.00 |          |
|   | Visa (Nick)             |       0.00 |          |
|   | Capital One (Miranda)   |       0.00 |          |
|   | Capital One (Nick)      |       0.00 |          |
|   | Chase (Miranda)         |       0.00 |          |
|   | Chase (Nick)            |       0.00 |          |
|   | Discover Card (Miranda) |       0.00 |          |
|   | Student Loan (Nick)     |      60.00 |          |
|   | Student Loan (Miranda)  |       0.00 |          |
|   | Car Loan                |     311.00 |          |
|   | Other ____              |       0.00 |          |
|   | Other ____              |       0.00 |          |
|---+-------------------------+------------+----------|
| # | Subtotal                |            |     371. |
|---+-------------------------+------------+----------|
| # | Grand Total             |            |  2361.79 |
| # | - Total Income          |            |  3984.03 |
| # | Zero                    |            |  1622.24 |
|---+-------------------------+------------+----------|
#+TBLFM: @>>$4=remote(incomeSheet, @>$2)::@3$4=@-1$-1::@7$4=vsum(@-II$-1..@-I$-1)::@12$4=vsum(@-II$-1..@-I$-1)::@21$4=vsum(@-II$-1..@-I$-1)::@24$4=vsum(@-II$-1..@-I$-1)::@31$4=vsum(@-II$-1..@-I$-1)::@36$4=vsum(@-II$-1..@-I$-1)::@41$4=vsum(@-II$-1..@-I$-1)::@49$4=vsum(@-II$-1..@-I$-1)::@51$4=vsum(@-II$-1..@-I$-1)::@56$4=vsum(@-II$-1..@-I$-1)::@70$4=vsum(@-II$-1..@-I$-1)::@71$4=vsum(@<<<$>..@>>>>$>::@73$4=@-1$>-@-2$>

** Allocated Spending Plan
#+NAME: spendingPlan
|---+-------------------+--------+----------+---------+----------|
|   | Income Period     |     01 |          |      15 |          |
|   | Income            |   1991 |          |    1995 |          |
| ^ |                   |    bom |          |     mmp |          |
|---+-------------------+--------+----------+---------+----------|
|   | Item              | Amount | Leftover |  Amount | Leftover |
|---+-------------------+--------+----------+---------+----------|
|   | Savings           |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Emergency fund    |   0.00 |    1991. |    0.00 |    1995. |
| # | Retirement fund   |   0.00 |    1991. |    0.00 |    1995. |
|---+-------------------+--------+----------+---------+----------|
|   | Housing           |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Rent              |   0.00 |    1991. | 1000.00 |     995. |
| # | Renters Insurance |   0.00 |    1991. |    0.00 |     995. |
| # | Replace Furniture |   0.00 |    1991. |    0.00 |     995. |
| # | Other ___         |   0.00 |    1991. |    0.00 |     995. |
|---+-------------------+--------+----------+---------+----------|
|   | Utilities         |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Electricity       |   0.00 |    1991. |    0.00 |     995. |
| # | Water             |   0.00 |    1991. |    0.00 |     995. |
| # | Gas               |   0.00 |    1991. |    0.00 |     995. |
| # | Phone             |   0.00 |    1991. |  105.00 |     890. |
| # | Internet          |   0.00 |    1991. |   55.00 |     835. |
| # | Adobe             |   0.00 |    1991. |   16.00 |     819. |
| # | Hulu              |   0.00 |    1991. |    9.99 |   809.01 |
|---+-------------------+--------+----------+---------+----------|
|   | Food              |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Grocery           | 150.00 |    1841. |  150.00 |   659.01 |
|---+-------------------+--------+----------+---------+----------|
|   | Recreation        |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Entertainment     |  60.00 |    1781. |   60.00 |   599.01 |
| # | Restaurants       |  40.00 |    1741. |   40.00 |   559.01 |
|   | Transportation    |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Car Payment 1     |   0.00 |    1741. |  311.00 |   248.01 |
| # | Gas and Oil       |  50.00 |    1691. |   50.00 |   198.01 |
| # | Repairs and Tires |   0.00 |    1691. |    0.00 |   198.01 |
| # | Car Insurance     |   0.00 |    1691. |   65.00 |   133.01 |
| # | License and Taxes |   0.00 |    1691. |    0.00 |   133.01 |
| # | Car Replacement   |   0.00 |    1691. |    0.00 |   133.01 |
|---+-------------------+--------+----------+---------+----------|
|   | Clothing          |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Adults            |  50.00 |    1641. |   50.00 |    83.01 |
| # | Cleaning/Laundry  |  20.00 |    1621. |   25.00 |    58.01 |
|---+-------------------+--------+----------+---------+----------|
|   | Medical/Health    |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Health Insurance  |   0.00 |    1621. |    0.00 |    58.01 |
| # | Drugs             |   0.00 |    1621. |    0.00 |    58.01 |
|---+-------------------+--------+----------+---------+----------|
|   | Personal          |        |          |         |          |
|---+-------------------+--------+----------+---------+----------|
| # | Life Insurance    |   0.00 |    1621. |    0.00 |    58.01 |
| # | Toiletries        |   0.00 |    1621. |    0.00 |    58.01 |
| # | Cosmetics         |   0.00 |    1621. |    0.00 |    58.01 |
| # | Hair Care         |   0.00 |    1621. |    0.00 |    58.01 |
| # | Gifts             |   0.00 |    1621. |    0.00 |    58.01 |
| # | Misc              |   0.00 |    1621. |    0.00 |    58.01 |
|---+-------------------+--------+----------+---------+----------|
| # | Blow $$           |  40.00 |    1581. |   40.00 |    18.01 |
|---+-------------------+--------+----------+---------+----------|
#+TBLFM: @6$4=$bom-$-1::@6$6=$mmp-$-1::@7$4=@-1$4-$-1::@7$6=@-1-$-1::@9$4=@-2-$-1::@9$6=@-2-$-1::@10$4=@-1-$-1::@10$6=@-1-$-1::@11$4=@-1-$-1::@11$6=@-1-$-1::@12$4=@-1-$-1::@12$6=@-1-$-1::@14$4=@-2-$-1::@14$6=@-2-$-1::@15$4=@-1-$-1::@15$6=@-1-$-1::@16$4=@-1-$-1::@16$6=@-1-$-1::@17$4=@-1-$-1::@17$6=@-1-$-1::@18$4=@-1-$-1::@18$6=@-1-$-1::@19$4=@-1-$-1::@19$6=@-1-$-1::@20$4=@-1-$-1::@20$6=@-1-$-1::@22$4=@-2-$-1::@22$6=@-2-$-1::@24$4=@-2-$-1::@24$6=@-2-$-1::@25$4=@-1-$-1::@25$6=@-1-$-1::@27$4=@-2-$-1::@27$6=@-2-$-1::@28$4=@-1-$-1::@28$6=@-1-$-1::@29$4=@-1-$-1::@29$6=@-1-$-1::@30$4=@-1-$-1::@30$6=@-1-$-1::@31$4=@-1-$-1::@31$6=@-1-$-1::@32$4=@-1-$-1::@32$6=@-1-$-1::@34$6=@-2-$-1::@35$4=@-2-$-1::@35$6=@-1-$-1::@36$4=@-1-$-1::@37$6=@-2-$-1::@38$4=@-2-$-1::@38$6=@-1-$-1::@39$4=@-1-$-1::@40$6=@-2-$-1::@41$4=@-2-$-1::@41$6=@-1-$-1::@42$4=@-1-$-1::@42$6=@-1-$-1::@43$4=@-1-$-1::@43$6=@-1-$-1::@44$4=@-1-$-1::@44$6=@-1-$-1::@45$4=@-1-$-1::@45$6=@-1-$-1::@46$4=@-1-$-1::@46$6=@-1-$-1::@47$4=@-1-$-1

** Monthly Expenses Budget Table
#+NAME: monthbudgettable
|---+------------------+---------------+----------------+------------+-------------+------------------+---------------|
| ! |                  | PercentageLow | PercentageHigh | DollarsLow | DollarsHigh | PercentageChosen | DollarsChosen |
| # | 3984.03          |               |                |            |             |                  |               |
| ^ | INCOME           |               |                |            |             |                  |               |
|---+------------------+---------------+----------------+------------+-------------+------------------+---------------|
| # | Charitable gifts |           .10 |            .15 |     398.40 |      597.60 |             0.00 |          0.00 |
| # | Savings          |           .10 |            .15 |     398.40 |      597.60 |             0.70 |       2770.00 |
| # | Housing          |           .25 |            .35 |     996.01 |     1394.41 |             0.42 |       1670.00 |
| # | Utilities        |           .05 |            .10 |     199.20 |      398.40 |             0.05 |        200.00 |
| # | Food             |           .05 |            .15 |     199.20 |      597.60 |             0.08 |        300.00 |
| # | Transportation   |           .10 |            .15 |     398.40 |      597.60 |             0.05 |        180.00 |
| # | Clothing         |           .02 |            .07 |      79.68 |      278.88 |             0.03 |        100.00 |
| # | Medical/Health   |           .05 |            .10 |     199.21 |      398.41 |             0.00 |          0.00 |
| # | Personal         |           .05 |            .10 |     199.20 |      398.40 |             0.05 |        200.00 |
| # | Recreation       |           .05 |            .10 |     199.20 |      398.40 |             0.04 |        160.00 |
| # | Blow             |           .02 |            .05 |      79.68 |      199.20 |             0.02 |         80.00 |
| # | Debts            |           .05 |            .10 |     199.20 |      398.40 |             0.11 |        450.00 |
|---+------------------+---------------+----------------+------------+-------------+------------------+---------------|
#+TBLFM: $5=$PercentageLow*$INCOME;%.2f::$6=$PercentageHigh*$INCOME;%.2f::$7=$DollarsChosen/$INCOME;%.2f::@2$2=remote(incomeSheet, @>$2)::@6$>=vsum(@7$>..@>$>);%.2f

